In [ ]:
#1.Load And Inspect Data

import pandas as pd

df = pd.read_csv("train.csv")

print(df.shape)
print(df.info())
df.head(5)

(891, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#2. Column summary

summary = pd.DataFrame({
    "Column": df.columns,
    "dtype": df.dtypes.values,
    "Missing": df.isnull().sum().values,
    "Unique": df.nunique().values
})
summary.sort_values("Missing", ascending=False)

         Column    dtype  Missing  Unique
10        Cabin   object      687     147
5           Age  float64      177      88
11     Embarked   object        2       3
0   PassengerId    int64        0     891
3          Name   object        0     891
2        Pclass    int64        0       3
1      Survived    int64        0       2
4           Sex   object        0       2
7         Parch    int64        0       7
6         SibSp    int64        0       7
9          Fare  float64        0     248
8        Ticket   object        0     681